Revit 2026 API

# MasonryCMUType Enumeration

---

The enumerated type representing the permitted values for the asset property "MasonryCMUType" from the "MasonryCMU" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum MasonryCMUType
```
```vb
Public Enumeration MasonryCMUType
```
```cpp
public enum class MasonryCMUType
```
```fsharp
type MasonryCMUType
```

| Member name | Value | Description |
| --- | --- | --- |
| Cmu | 0 |  |
| Masonry | 1 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace